app/controllers/conversions_controller.rb

SELECT "conversions".* FROM "conversions"
---
  def index
    @conversion = Conversion.all