app/controllers/search_controller.rb

SELECT "urls".* FROM "urls" WHERE 1=0
---
  def search
    if params[:q].nil?
      @urls = []
    else
      @urls = Url.search params[:q]