app/controllers/urls_controller.rb

  def long_to_short
    domain_name = DomainsHelper.get_domain_name_from_url(url_params[:long_url_inp])
    @req_ans = Url.shorten_url(url_params[:long_url_inp] , domain_name)
    respond_to do |format|
      if @req_ans == false
        @req_ans = ""
        flash.now[:error] = "Domain not registered"
        format.html {render 'urls/new'}
        format.json {render json: {"error" => "Domain not registered"}, status: :not_found}
      end

      format.html {render 'urls/new'}
      format.json { render json: {"short_domain" => @req_ans.split("/").first , "short_url" => @req_ans.split("/").last}, status: :ok}
---
SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "youtube"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "charmander"], ["LIMIT", 1]]