app/models/domain.rb

  def self.new_domain_entry(domain_name , short_domain)
    domain_name_entered = DomainsHelper.get_domain_name_from_url(domain_name)
    if Domain.find_by(domain_name: domain_name_entered)
      return "domain alredy has short domain"
    end
    if Domain.find_by(short_domain: short_domain)
      return "short domain already taken"
    end

    Domain.create(domain_name: domain_name_entered , short_domain: short_domain)
---
SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "www"], ["LIMIT", 1]]
SELECT  "domains".* FROM "domains" WHERE "domains"."short_domain" = $1 LIMIT $2  [["short_domain", "fb.ok"], ["LIMIT", 1]]
INSERT INTO "domains" ("domain_name", "short_domain", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["domain_name", "facebook"], ["short_domain", "fb.ok"], ["created_at", "2019-01-31 08:57:21.591027"], ["updated_at", "2019-01-31 08:57:21.591027"]]