app/models/url.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "TuMLlqj"], ["LIMIT", 1]]
---
	def self.random_string_for_url
		possible_short = UrlsHelper.random_62bit_string
		while Url.find_by(short_url: possible_short) != nil do

SELECT  "domains".* FROM "domains" WHERE "domains"."domain_name" = $1 LIMIT $2  [["domain_name", "youtube"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "www.youtube.com/magby"], ["LIMIT", 1]]
INSERT INTO "urls" ("long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long_url", "www.google.com/charmander"], ["short_url", "o2mp7Ia"], ["created_at", "2019-01-31 05:19:58.279889"], ["updated_at", "2019-01-31 05:19:58.279889"]]
---
	def self.shorten_url(long_url , long_domain)
		#Rails.cache.clear
    domain_var = Domain.find_by(domain_name: long_domain)
    if !domain_var
      return false
    end

    long_url_var = Url.find_by(long_url: long_url)
		if long_url_var
      return (domain_var.short_domain) + "/" + (long_url_var.short_url)
		else
      possible_short = Url.random_string_for_url
      Url.create({:long_url => long_url, :short_url => possible_short })

SELECT  "urls".* FROM "urls" WHERE "urls"."long_url" = $1 LIMIT $2  [["long_url", "charmander"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "WqXulHL"], ["LIMIT", 1]]
---
	def self.find_long_url(short_url)
		long_url = Rails.cache.fetch(short_url , :expires_in => 5.minutes)
		if long_url
			return long_url
		end

    long_url_var = Url.find_by(short_url: short_url)