app/models/user.rb

  def self.login_using_credentials(login_params)
    md5_password = Digest::MD5.hexdigest(login_params[:password])
    if User.find_by(username: login_params[:username] , password: md5_password)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."password" = $2 LIMIT $3  [["username", "raka"], ["password", "202cb962ac59075b964b07152d234b70"], ["LIMIT", 1]]

  def self.signup_using_credentials(signup_params)
    md5_password = Digest::MD5.hexdigest(signup_params[:password])
    users = User.create({:username => signup_params[:username] , :password => md5_password , :email => signup_params[:email] , :name => signup_params[:fullname]})
---
INSERT INTO "users" ("username", "password", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def self.check_username_available(signup_params)
    if User.find_by(username: signup_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "abc"], ["LIMIT", 1]]

  def self.check_email_available(signup_params)
    if User.find_by(email: signup_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "something@gmail.com"], ["LIMIT", 1]]